In [1]:
import pandas as pd

### Задание 1
Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. Определите какому фильму было выставлено больше всего оценок 5.0.

In [2]:
film = pd.read_csv('movies.csv')
rate = pd.read_csv('ratings.csv')

In [3]:
rate.head(2)

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247

In [4]:
film.head(2)

   movieId             title                                       genres
0        1  Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
1        2    Jumanji (1995)                   Adventure|Children|Fantasy

In [6]:
df = pd.merge(rate, film, on = 'movieId')
df.head(3)

,userId,movieId,rating,timestamp,title,genres
0,1,1,4.0,964982703,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,5,1,4.0,847434962,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
2,7,1,4.5,1106635946,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy

In [8]:
only_5 = df[df['rating'] == 5][['movieId', 'rating']]

In [9]:
only_5.head(3)

    movieId  rating
9         1     5.0
12        1     5.0
13        1     5.0

In [11]:
only_5.groupby('movieId').count().sort_values(by = 'rating', ascending=False).head(3)

         rating
movieId
318         153
296         123
356         116

In [12]:
film[film['movieId'] == 318]

     movieId                             title       genres
277      318  Shawshank Redemption, The (1994)  Crime|Drama

### Задание 2
По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) категорий 4, 12 и 21 за период с 2005 по 2010 года. Не учитывайте в расчетах отрицательные значения quantity.

In [13]:
data = pd.read_csv('power.csv')

In [14]:
data.head(4)

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1

In [54]:
filtered_countries = data[ ((data['country']=='Latvia') | 
                           (data['country']=='Estonia') | 
                           (data['country']=='Lithuania')) &
                           ((data['category']==4) |
                           (data['category']==12) |
                           (data['category']==21)) &
                           ((data['year']==2005) |
                            (data['year']==2006) |
                            (data['year']==2007) |
                            (data['year']==2008) |
                            (data['year']==2009) |
                            (data['year']==2010)) &
                           (data['quantity'] > 0)
                         ]

In [55]:
filtered_countries['quantity'].sum()

240580.0

### Задание 3
Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.

In [78]:
ww = pd.read_html('https://fortrader.org/quotes',encoding='utf-8')

In [79]:
ww[0]

                           Название   Цена  Изменение  Изменение(%)  Обновлено
0  EURRUB Курс евро к рублю сегодня  91.83        0.0           0.0        NaN
1       USDRUB Курс рубля к доллару  75.75        0.0           0.0        NaN

In [80]:
ww[1]

,Название,Цена,Изменение,Изменение(%),Обновлено
0,Нефть Brent Курс нефти сегодня,54.85,-0.02,-0.04,NaN
1,Нефть WTI Цены на нефть WTI,51.94,0.02,0.04,NaN
2,Природный газ Цена на природный газ,2.72,-0.01,-0.18,NaN
3,Кофе,122.35,0.00,0.00,NaN
4,Кукуруза,547.00,-0.20,-0.04,NaN
5,Соя,430.90,0.20,0.05,NaN
6,Хлопок,80.64,0.00,0.00,NaN